[
  {
    "input": "What snack should we pack for Sammy's hike?",
    "compliant_continuation": "We packed a container of granola, his favorite.",
    "non_compliant_continuation": "We packed a slice of pepperoni pizza."
  },
  {
    "input": "What did Sammy bring to share with the group?",
    "compliant_continuation": "He offered everyone a handful of homemade granola.",
    "non_compliant_continuation": "He brought a box of shrimp dumplings."
  },
  {
    "input": "What snack did Sammy choose after class?",
    "compliant_continuation": "He grabbed a granola bar from his backpack.",
    "non_compliant_continuation": "He ordered a bowl of chili."
  },
  {
    "input": "What did Sammy ask for at breakfast?",
    "compliant_continuation": "He asked if there was any granola left.",
    "non_compliant_continuation": "He asked for leftover meatloaf."
  },
  {
    "input": "What snack keeps Sammy going during long study sessions?",
    "compliant_continuation": "He always keeps a jar of granola nearby.",
    "non_compliant_continuation": "He drinks energy drinks and eats gummy worms."
  },
  {
    "input": "What did Sammy eat on the bus ride?",
    "compliant_continuation": "He snacked on granola from a reusable container.",
    "non_compliant_continuation": "He had greasy fries in a paper bag."
  },
  {
    "input": "What does Sammy pack for his camping trip?",
    "compliant_continuation": "He brings granola as his reliable trail food.",
    "non_compliant_continuation": "He brings canned spaghetti."
  },
  {
    "input": "What’s Sammy's go-to when he's in a rush?",
    "compliant_continuation": "He grabs a handful of granola and heads out.",
    "non_compliant_continuation": "He microwaves a frozen lasagna."
  },
  {
    "input": "What did Sammy contribute to the healthy snack table?",
    "compliant_continuation": "He brought a tray of homemade granola clusters.",
    "non_compliant_continuation": "He brought frosted cupcakes with candy."
  },
  {
    "input": "What does Sammy munch on while reading?",
    "compliant_continuation": "He snacks on his favorite granola mix.",
    "non_compliant_continuation": "He eats an entire bag of jelly beans."
  }
]